<template>
  <div >
      <swiper class="swiper" :options="swiperOption">
        <swiper-slide class="text">
            <div class="centent">
               看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。看过科幻电影的朋友们都知道，巨人一族是非常强大的一个种族，身高十多尺，力大无穷，连坦克都被它掀翻。看完电影后会让人感到一阵热血沸腾，冷静之后便会想，我们地球上真的存在着巨人吗？

6500多万年前，地球因遭受到小行星的撞击，恐龙时代毁灭，接着人类诞生，便成为了地球的主宰。但也自那之后，地球上再也没发现过巨人的痕迹，难道它们也随着恐龙一起灭绝了吗？

然而，正当一些对巨人感兴趣的生物学家心灰意冷时，一则消息传来立即让他们振奋了起来，有人在俄罗斯的某地发现了疑似巨人的脚印。当生物学家前往目的地进行测量后，发现那脚印有3米长，2米宽，形状与人类非常相似，因而他们推测这很有可能就是远古巨人的脚印。
            </div>
        </swiper-slide>
      </swiper>
  </div>
</template>

<script>
    import 'swiper/dist/css/swiper.css' 
    import { swiper, swiperSlide } from 'vue-awesome-swiper'
    export default {
        data() {
            return {
                swiperOption:{
                    direction:'vertical',
                    slidesPerView: 'auto',
                    freeMode:true,
                    mousewheel:true
                }
            }
        },
        components:{swiper,swiperSlide}
    }
</script>


<style scoped>
  .swiper{
      height: 300px;
      overflow: hidden;
  }
  .text{
      font-size: 18px !important;
      text-align: left;
      padding:30px;
      height: auto;
      -webkit-box-sizing: border-box;
      box-sizing: border-box;
  }
</style>